// 3. Напишите программу, которая будет выдавать
// название дня недели по заданному номеру.
// 3 -> Среда
// 5 -> Пятница
// 20 мин
 int number;
 Console.WriteLine("Введите номер дня недели");
 number = int.Parse(Console.ReadLine());

 if 

